{
  "documents": [
    {
      "id": "cc334e0e",
      "filename": "demo1.png",
      "extracted_text": "S1. Malicious users can deface the website.\n\nS2. Any harmful actor may get access to confidential information.\n\nS3. The availability of the website/app can be hampered.\n\nS4. The malicious user may change/modify the content on the website.\n\nS5. Security failures typically lead to unauthorised information disclosure, modification, or destruction of all data or performing a business function outside the user's limits.\n\nS6. A file upload flaw allows an attacker to retrieve the password database. Security of web applications determine the protection needs of data in transit and at rest. Attackers can steal such information for example: passwords, credit card numbers, health records, personal information and business secrets require extra protection, mainly if that data falls under privacy laws, Personal data protection bill etc.\n\nS7. An attacker monitors network traffic (e.g. at an insecure wireless network), downgrades connections from HTTPS to HTTP, intercepts requests and steals the user's session cookie. The attacker then replays this cookie and hijacks the user's (authenticated) session, accessing or modifying the user's private data. Instead of the above, they could alter all transported data, e.g. the recipient of a money transfer.\n\nS8. Almost any source of data can be an injection vector: environment variables, parameters, external and internal web services, and all types of users. Injection flaws occur when an attacker can send hostile data to an interpreter.\n\nS9. Attackers have to gain access to only a few accounts, or just one admin account to compromise the system. Depending on the domain of the application, this may allow money laundering, social security fraud and identity theft, or disclose legally protected highly sensitive information.\n\nS10. Security flaws can be used to extract data, execute a remote request from the server, scan internal systems, perform a denial-of-service attack, as well as execute other attacks. The business impact depends on the protection needs of all affected applications and data.\n\nS11. Attackers acting as users or administrators, or users using privileged functions, can create, access, update or delete every record.",
      "source_type": "upload",
      "ocr_confidence": 0.8143,
      "block_count": 70,
      "blocks": [],
      "file_size_bytes": 227826,
      "mime_type": "image/png",
      "created_at": "2026-02-19T04:20:23.931553+00:00",
      "updated_at": "2026-02-19T06:09:44.332313+00:00",
      "tags": [],
      "notes": "",
      "chunks": [
        {
          "label": "S1",
          "text": "Malicious users can deface the website."
        },
        {
          "label": "S2",
          "text": "Any harmful actor may get access to confidential information."
        },
        {
          "label": "S3",
          "text": "The availability of the website/app can be hampered."
        },
        {
          "label": "S4",
          "text": "The malicious user may change/modify the content on the website."
        },
        {
          "label": "S5",
          "text": "Security failures typically lead to unauthorised information disclosure, modification, or destruction of all data or performing a business function outside the user's limits."
        },
        {
          "label": "S6",
          "text": "A file upload flaw allows an attacker to retrieve the password database. Security of web applications determine the protection needs of data in transit and at rest. Attackers can steal such information for example: passwords, credit card numbers, health records, personal information and business secrets require extra protection, mainly if that data falls under privacy laws, Personal data protection bill etc."
        },
        {
          "label": "S7",
          "text": "An attacker monitors network traffic (e.g. at an insecure wireless network), downgrades connections from HTTPS to HTTP, intercepts requests and steals the user's session cookie. The attacker then replays this cookie and hijacks the user's (authenticated) session, accessing or modifying the user's private data. Instead of the above, they could alter all transported data, e.g. the recipient of a money transfer."
        },
        {
          "label": "S8",
          "text": "Almost any source of data can be an injection vector: environment variables, parameters, external and internal web services, and all types of users. Injection flaws occur when an attacker can send hostile data to an interpreter."
        },
        {
          "label": "S9",
          "text": "Attackers have to gain access to only a few accounts, or just one admin account to compromise the system. Depending on the domain of the application, this may allow money laundering, social security fraud and identity theft, or disclose legally protected highly sensitive information."
        },
        {
          "label": "S10",
          "text": "Security flaws can be used to extract data, execute a remote request from the server, scan internal systems, perform a denial-of-service attack, as well as execute other attacks. The business impact depends on the protection needs of all affected applications and data."
        },
        {
          "label": "S11",
          "text": "Attackers acting as users or administrators, or users using privileged functions, can create, access, update or delete every record."
        }
      ]
    },
    {
      "id": "0cb7aec1",
      "filename": "Screenshot 2026-02-19 094546 (1).png",
      "extracted_text": "S12. Security misconfiguration frequently gives attackers unauthorised access to some system data or functionality Occasionally, such flaws result in a complete system compromise\n28\n4. Focus areas\n\nS13. The impact of XSS is moderate for reflected and DOM XSS and severe for stored XSS, with remote code execution on the victim's browser, such as stealing credentials, sessions, or delivering malware to the victim_\n\nS14. While some known vulnerabilities lead to only minor impacts, some of the largest breaches to date have relied on exploiting known vulnerabilities in components.\n\nS15.Most successful attacks start with vulnerability probing: Allowing such probes to continue can raise the likelihood of a successful exploit to nearly 10O%.",
      "source_type": "upload",
      "ocr_confidence": 0.8451,
      "block_count": 14,
      "blocks": [],
      "file_size_bytes": 80371,
      "mime_type": "image/png",
      "created_at": "2026-02-19T04:49:34.823051+00:00",
      "updated_at": "2026-02-19T06:09:44.333307+00:00",
      "tags": [],
      "notes": "",
      "chunks": [
        {
          "label": "S12",
          "text": "Security misconfiguration frequently gives attackers unauthorised access to some system data or functionality Occasionally, such flaws result in a complete system compromise\n28\n4. Focus areas"
        },
        {
          "label": "S13",
          "text": "The impact of XSS is moderate for reflected and DOM XSS and severe for stored XSS, with remote code execution on the victim's browser, such as stealing credentials, sessions, or delivering malware to the victim_"
        },
        {
          "label": "S14",
          "text": "While some known vulnerabilities lead to only minor impacts, some of the largest breaches to date have relied on exploiting known vulnerabilities in components."
        },
        {
          "label": "S15",
          "text": "Most successful attacks start with vulnerability probing: Allowing such probes to continue can raise the likelihood of a successful exploit to nearly 10O%."
        }
      ]
    }
  ],
  "metadata": {
    "created_at": "2026-02-19T08:44:00+05:30",
    "version": "1.1",
    "total_documents": 2
  }
}